jmeter/report/statistics.json
{
  "登录" : {
    "transaction" : "登录",
    "sampleCount" : 150,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 591.04,
    "medianResTime" : 624.5,
    "minResTime" : 19.0,
    "maxResTime" : 1636.0,
    "pct1ResTime" : 1004.9,
    "pct2ResTime" : 1230.5,
    "pct3ResTime" : 1530.4300000000019,
    "throughput" : 11.203226529240421,
    "receivedKBytesPerSec" : 5.639249103741878,
    "sentKBytesPerSec" : 2.9345013863992833
  },
  "发布评论" : {
    "transaction" : "发布评论",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1988.296,
    "medianResTime" : 1983.5,
    "minResTime" : 138.0,
    "maxResTime" : 4708.0,
    "pct1ResTime" : 3084.4000000000005,
    "pct2ResTime" : 3341.35,
    "pct3ResTime" : 3965.51,
    "throughput" : 5.354465624330691,
    "receivedKBytesPerSec" : 2.7197234251177984,
    "sentKBytesPerSec" : 1.8279852819126152
  },
  "收藏" : {
    "transaction" : "收藏",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2152.6080000000006,
    "medianResTime" : 2124.0,
    "minResTime" : 366.0,
    "maxResTime" : 7558.0,
    "pct1ResTime" : 3143.2000000000007,
    "pct2ResTime" : 3593.25,
    "pct3ResTime" : 5289.130000000004,
    "throughput" : 5.27198152697673,
    "receivedKBytesPerSec" : 1.2736880838719542,
    "sentKBytesPerSec" : 1.6666360507322784
  },
  "帖子详情" : {
    "transaction" : "帖子详情",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2927.6450000000004,
    "medianResTime" : 2134.0,
    "minResTime" : 31.0,
    "maxResTime" : 8004.0,
    "pct1ResTime" : 5712.099999999999,
    "pct2ResTime" : 6274.849999999999,
    "pct3ResTime" : 7050.1900000000005,
    "throughput" : 9.8294588882882,
    "receivedKBytesPerSec" : 7.932219737553448,
    "sentKBytesPerSec" : 2.793332555167838
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 6300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2168.0020634920575,
    "medianResTime" : 1934.0,
    "minResTime" : 11.0,
    "maxResTime" : 8004.0,
    "pct1ResTime" : 4082.800000000001,
    "pct2ResTime" : 4880.749999999999,
    "pct3ResTime" : 6084.9299999999985,
    "throughput" : 60.761544693491764,
    "receivedKBytesPerSec" : 133.55149608726998,
    "sentKBytesPerSec" : 18.547953170812278
  },
  "注册(已存在则忽略)" : {
    "transaction" : "注册(已存在则忽略)",
    "sampleCount" : 150,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1635.239999999999,
    "medianResTime" : 1697.0,
    "minResTime" : 95.0,
    "maxResTime" : 4078.0,
    "pct1ResTime" : 2833.9000000000005,
    "pct2ResTime" : 3065.45,
    "pct3ResTime" : 3983.1400000000017,
    "throughput" : 11.209924519841566,
    "receivedKBytesPerSec" : 2.3645934534040802,
    "sentKBytesPerSec" : 3.3546574900979
  },
  "评论列表" : {
    "transaction" : "评论列表",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2514.917,
    "medianResTime" : 2665.0,
    "minResTime" : 86.0,
    "maxResTime" : 5009.0,
    "pct1ResTime" : 3610.7,
    "pct2ResTime" : 3838.7499999999995,
    "pct3ResTime" : 4425.87,
    "throughput" : 9.975261351847418,
    "receivedKBytesPerSec" : 32.323041980887396,
    "sentKBytesPerSec" : 2.922439849174048
  },
  "点赞" : {
    "transaction" : "点赞",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2108.019999999999,
    "medianResTime" : 2054.0,
    "minResTime" : 340.0,
    "maxResTime" : 5066.0,
    "pct1ResTime" : 3106.6000000000004,
    "pct2ResTime" : 3460.45,
    "pct3ResTime" : 4416.740000000002,
    "throughput" : 5.369358146927117,
    "receivedKBytesPerSec" : 1.260519747156925,
    "sentKBytesPerSec" : 1.771091174386014
  },
  "帖子列表" : {
    "transaction" : "帖子列表",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3251.308000000001,
    "medianResTime" : 3394.0,
    "minResTime" : 94.0,
    "maxResTime" : 5983.0,
    "pct1ResTime" : 4520.7,
    "pct2ResTime" : 4874.399999999998,
    "pct3ResTime" : 5604.610000000001,
    "throughput" : 9.746588693957115,
    "receivedKBytesPerSec" : 86.5568557352583,
    "sentKBytesPerSec" : 3.0648452729044835
  },
  "关注" : {
    "transaction" : "关注",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1613.39,
    "medianResTime" : 1593.0,
    "minResTime" : 257.0,
    "maxResTime" : 4310.0,
    "pct1ResTime" : 2313.5,
    "pct2ResTime" : 2545.7499999999995,
    "pct3ResTime" : 3056.6900000000005,
    "throughput" : 5.211318984835062,
    "receivedKBytesPerSec" : 1.1654219214133097,
    "sentKBytesPerSec" : 1.5831926005784565
  },
  "通知未读数" : {
    "transaction" : "通知未读数",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 699.4439999999993,
    "medianResTime" : 706.0,
    "minResTime" : 11.0,
    "maxResTime" : 2425.0,
    "pct1ResTime" : 1169.2999999999997,
    "pct2ResTime" : 1288.9499999999998,
    "pct3ResTime" : 1750.6300000000003,
    "throughput" : 10.120638005019837,
    "receivedKBytesPerSec" : 2.10517177252854,
    "sentKBytesPerSec" : 3.0539815854991494
  }
}